; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	thermograph1 - mode
	infrared0 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star2 - direction
	Star0 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument7 infrared0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite2 Star7)
	(pointing satellite3 Star4)
	(have_image Phenomenon6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared0)
))

)

; plan
1. (turn_to satellite2 star7 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star7)
   goals met: 3 of 8
2. (turn_to satellite0 star4 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star4)
   goals met: 2 of 8
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
4. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 8
5. (turn_to satellite0 phenomenon9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 8
6. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 3 of 8
7. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 8
8. (take_image satellite0 phenomenon6 instrument0 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 4 of 8
9. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 4 of 8
10. (take_image satellite0 star7 instrument0 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 5 of 8
11. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 5 of 8
12. (take_image satellite0 star8 instrument0 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 6 of 8
13. (turn_to satellite0 planet10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet10)
   goals met: 7 of 8
14. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 8 of 8
